{
  "categories": [
    { "id": 0, "name": "All" },
    { "id": 1, "name": "Hot Coffees" },
    { "id": 2, "name": "Cold Coffees" },
    { "id": 3, "name": "Frappuccino Blends" },
    { "id": 4, "name": "Pastries" }
  ],

  "products": [
    {
      "id": 1,
      "category": "Hot Coffees",
      "name": "Caffè Americano",
      "description": "Rich espresso with hot water for a deep, flavorful cup.",
      "longDesc": "Our Caffè Americano is crafted by combining rich, full-bodied espresso shots with hot water to create a light layer of crema. This classic coffee drink delivers a bold, smooth taste that's perfect for those who enjoy a robust coffee experience without the intensity of straight espresso. Enjoy it black or customize with milk and sweetener to your preference.",
      "price": 3.5,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Caffè Americano.webp",
      "isFavorite": false
    },
    {
      "id": 2,
      "category": "Hot Coffees",
      "name": "Cappuccino",
      "description": "Espresso, steamed milk, and foam blended to perfection.",
      "longDesc": "A traditional Italian classic, our Cappuccino features a perfect balance of dark, rich espresso layered with velvety steamed milk and crowned with a thick, luxurious foam. Each sip delivers a harmonious blend of bold coffee flavor and creamy texture. The artful preparation ensures every cup is a masterpiece, making it an ideal choice for coffee lovers who appreciate time-honored brewing techniques.",
      "price": 4.0,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Cappuccino.jpg",
      "isFavorite": true
    },
    {
      "id": 3,
      "category": "Hot Coffees",
      "name": "Caffè Latte",
      "description": "Smooth blend of espresso and steamed milk with a light foam layer.",
      "longDesc": "Our Caffè Latte is a smooth and creamy coffee beverage that combines fresh espresso with perfectly steamed milk, finished with a delicate layer of foam. This comforting drink offers a milder coffee flavor compared to a cappuccino, making it an excellent choice for those who prefer a gentler coffee experience. Add your favorite flavor syrup to create your own personalized latte masterpiece.",
      "price": 4.2,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Caffè Latte.avif",
      "isFavorite": false
    },
    {
      "id": 4,
      "category": "Hot Coffees",
      "name": "Espresso",
      "description": "A bold, rich shot of pure espresso.",
      "longDesc": "Experience the pure, concentrated essence of coffee with our expertly crafted Espresso. Made from premium dark-roasted coffee beans and extracted under precise pressure, each shot delivers an intense, full-bodied flavor with a rich crema on top. Whether you enjoy it solo or doppio, our espresso provides the perfect foundation for any espresso-based beverage or stands alone as a quick, powerful coffee experience.",
      "price": 2.8,
      "sizes": ["Solo", "Doppio"],
      "image": "/pic/Espresso.avif",
      "isFavorite": false
    },
    {
      "id": 5,
      "category": "Hot Coffees",
      "name": "Flat White",
      "description": "Velvety steamed milk poured over ristretto shots of espresso.",
      "longDesc": "Originating from Australia and New Zealand, the Flat White is a sophisticated coffee drink featuring ristretto shots of espresso combined with microfoam-textured milk. Unlike a latte, it has less foam and a higher proportion of coffee to milk, resulting in a stronger espresso flavor with a silky smooth texture. The velvety microfoam creates a perfect canvas for latte art, making each cup both visually stunning and delicious.",
      "price": 4.6,
      "sizes": ["Tall", "Grande"],
      "image": "/pic/Flat White.avif",
      "isFavorite": true
    },
    {
      "id": 6,
      "category": "Hot Coffees",
      "name": "Mocha",
      "description": "Espresso, bittersweet mocha sauce, and steamed milk topped with whipped cream.",
      "longDesc": "Indulge in our decadent Mocha, a chocolate lover's dream that combines the rich intensity of espresso with bittersweet mocha sauce and velvety steamed milk. Topped with a generous dollop of whipped cream, this drink offers the perfect balance of coffee and chocolate flavors. It's like enjoying a liquid dessert that energizes and satisfies your sweet tooth simultaneously.",
      "price": 4.7,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/caffe mocha.jpg",
      "isFavorite": false
    },
    {
      "id": 7,
      "category": "Hot Coffees",
      "name": "Caramel Macchiato",
      "description": "Espresso with vanilla-flavored syrup and milk topped with caramel drizzle.",
      "longDesc": "Our signature Caramel Macchiato is a beautifully layered beverage that starts with vanilla syrup, followed by steamed milk and a bold shot of espresso, finished with a crosshatch of rich caramel drizzle on top. The word 'macchiato' means 'marked' in Italian, referring to the espresso mark on top of the milk. This sweet and creamy drink offers a perfect balance of vanilla and caramel flavors with a strong coffee foundation.",
      "price": 4.8,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Caramel Macchiato.jpg",
      "isFavorite": true
    },
    {
      "id": 8,
      "category": "Hot Coffees",
      "name": "Chai Tea Latte",
      "description": "A spiced black tea infused with cinnamon, clove, and steamed milk.",
      "longDesc": "Transport yourself to distant lands with our aromatic Chai Tea Latte. This warming beverage blends black tea with an exotic mix of spices including cinnamon, clove, cardamom, and ginger, combined with steamed milk for a creamy finish. Each sip delivers a comforting warmth and complex flavor profile that's both energizing and soothing. Perfect for those seeking a caffeine boost with a unique, spiced twist.",
      "price": 4.3,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Chai Tea Latte.jpg",
      "isFavorite": false
    },
    {
      "id": 9,
      "category": "Hot Coffees",
      "name": "White Chocolate Mocha",
      "description": "Espresso, white chocolate sauce, and steamed milk topped with whipped cream.",
      "longDesc": "Elevate your coffee experience with our luxurious White Chocolate Mocha. This indulgent drink features bold espresso combined with sweet, creamy white chocolate sauce and steamed milk, crowned with whipped cream. The white chocolate provides a smoother, sweeter alternative to traditional mocha, creating a sophisticated flavor that's both rich and refined. It's the perfect treat for those who love their coffee with a touch of elegance.",
      "price": 5.0,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/White Chocolate Mocha.jpg",
      "isFavorite": true
    },
    {
      "id": 10,
      "category": "Hot Coffees",
      "name": "Cinnamon Dolce Latte",
      "description": "Espresso with steamed milk, cinnamon dolce syrup, and whipped cream.",
      "longDesc": "Warm up with our delightful Cinnamon Dolce Latte, a comforting blend of espresso, steamed milk, and sweet cinnamon dolce syrup. Topped with whipped cream and a sprinkle of cinnamon dolce topping, this beverage offers the perfect balance of sweet and spicy flavors. The cinnamon adds a warm, aromatic quality that makes this latte especially popular during cooler months, though it's delicious year-round.",
      "price": 4.9,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Cinnamon Dolce Latte.jpg",
      "isFavorite": false
    },
    {
      "id": 11,
      "category": "Cold Coffees",
      "name": "Iced Coffee",
      "description": "Freshly brewed coffee served over ice for a refreshing taste.",
      "longDesc": "Beat the heat with our refreshing Iced Coffee, made from freshly brewed coffee that's cooled and poured over ice. This classic cold beverage delivers a smooth, mellow coffee flavor that's perfect for warm days or whenever you need a cool caffeine boost. Customize it with your choice of milk, cream, or sweetener to create your perfect iced coffee experience.",
      "price": 3.8,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Iced Coffee.jpg",
      "isFavorite": false
    },
    {
      "id": 12,
      "category": "Cold Coffees",
      "name": "Iced Latte",
      "description": "Smooth espresso blended with milk and poured over ice.",
      "longDesc": "Our Iced Latte combines bold espresso shots with cold milk and ice to create a smooth, refreshing coffee beverage. The chilled milk helps mellow the intensity of the espresso while maintaining its rich flavor profile. This versatile drink serves as the perfect canvas for flavor customization – add vanilla, caramel, or hazelnut syrup to make it uniquely yours.",
      "price": 4.2,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Iced Latte.jpg",
      "isFavorite": true
    },
    {
      "id": 13,
      "category": "Cold Coffees",
      "name": "Iced Mocha",
      "description": "Espresso, mocha sauce, milk, and ice topped with whipped cream.",
      "longDesc": "Indulge in the cool, chocolatey goodness of our Iced Mocha. This refreshing treat combines rich espresso with bittersweet mocha sauce and milk, served over ice and topped with whipped cream. The chocolate and coffee flavors blend perfectly to create a dessert-like beverage that's both energizing and satisfying. It's the perfect pick-me-up for chocolate and coffee lovers alike.",
      "price": 4.6,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Iced Mocha.jpg",
      "isFavorite": false
    },
    {
      "id": 14,
      "category": "Cold Coffees",
      "name": "Iced Caramel Macchiato",
      "description": "Vanilla syrup, milk, and espresso over ice with caramel drizzle.",
      "longDesc": "Our Iced Caramel Macchiato is a refreshing twist on the classic favorite. Built upside-down with vanilla syrup at the bottom, cold milk and ice in the middle, and shots of espresso poured on top, finished with a decorative caramel drizzle. For the best experience, stir it before drinking to enjoy the full blend of flavors – sweet vanilla, rich espresso, and buttery caramel in every sip.",
      "price": 4.8,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Iced Caramel Macchiato.jpg",
      "isFavorite": true
    },
    {
      "id": 15,
      "category": "Cold Coffees",
      "name": "Iced Americano",
      "description": "Espresso shots topped with cold water and ice.",
      "longDesc": "Simple yet sophisticated, our Iced Americano delivers bold espresso flavor in a refreshingly cold format. Made by pouring espresso shots over cold water and ice, this drink maintains the intensity and complexity of hot Americano while providing a cool, crisp coffee experience. It's perfect for purists who want to enjoy the true essence of espresso without any sweetness or dairy.",
      "price": 3.5,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Iced Americano.jpg",
      "isFavorite": false
    },
    {
      "id": 16,
      "category": "Cold Coffees",
      "name": "Cold Brew",
      "description": "Slow-steeped, ultra-smooth cold coffee for a bold yet balanced flavor.",
      "longDesc": "Our Cold Brew is crafted through a meticulous 20-hour steeping process that extracts the coffee's full flavor while minimizing acidity and bitterness. The result is an ultra-smooth, naturally sweet coffee with a bold yet balanced taste. Served over ice, this refreshing beverage showcases the nuanced flavors of our premium coffee beans. It's perfect for those who appreciate a smoother, less acidic coffee experience.",
      "price": 4.5,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Cold Brew.jpg",
      "isFavorite": false
    },
    {
      "id": 17,
      "category": "Cold Coffees",
      "name": "Vanilla Sweet Cream Cold Brew",
      "description": "Cold brew coffee topped with vanilla sweet cream for a smooth finish.",
      "longDesc": "Elevate your cold brew experience with our Vanilla Sweet Cream Cold Brew. This sophisticated beverage features our signature slow-steeped cold brew topped with a house-made vanilla sweet cream that cascades through the coffee in a mesmerizing cascade. The sweet cream adds a luxurious, velvety texture and subtle vanilla sweetness that perfectly complements the smooth, bold cold brew. It's a visually stunning and deliciously satisfying drink.",
      "price": 4.9,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Vanilla Sweet Cream Cold Brew.jpg",
      "isFavorite": true
    },
    {
      "id": 18,
      "category": "Cold Coffees",
      "name": "Nitro Cold Brew",
      "description": "Infused with nitrogen for a naturally sweet, creamy flavor.",
      "longDesc": "Experience coffee innovation with our Nitro Cold Brew. This premium beverage is infused with nitrogen through a pressurized valve, creating a cascading effect similar to draft beer and resulting in a thick, creamy head. The nitrogen infusion enhances the coffee's natural sweetness and provides a velvety, smooth mouthfeel without any added cream or sugar. Served straight from the tap, it's a truly unique and impressive coffee experience.",
      "price": 5.0,
      "sizes": ["Tall", "Grande"],
      "image": "/pic/Nitro Cold Brew.jpg",
      "isFavorite": false
    },
    {
      "id": 19,
      "category": "Cold Coffees",
      "name": "Iced Shaken Espresso",
      "description": "Espresso shaken with ice and sweetened, topped with milk.",
      "longDesc": "Our Iced Shaken Espresso is a modern classic that combines bold espresso shots with classic syrup, all shaken together with ice to create a perfectly chilled, slightly frothy beverage. Topped with a splash of milk, this drink offers a lighter, more refreshing take on iced espresso drinks. The shaking process aerates the coffee and creates a silky texture with a subtle foam layer on top.",
      "price": 4.7,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Iced Shaken Espresso.jpg",
      "isFavorite": true
    },
    {
      "id": 20,
      "category": "Cold Coffees",
      "name": "Iced White Chocolate Mocha",
      "description": "Espresso with white chocolate, milk, and ice topped with whipped cream.",
      "longDesc": "Indulge in the cool elegance of our Iced White Chocolate Mocha. This luxurious beverage combines rich espresso with sweet white chocolate sauce and milk, served over ice and crowned with whipped cream. The white chocolate provides a smoother, creamier sweetness compared to traditional mocha, making this drink a sophisticated choice for those who enjoy their coffee with a refined touch of indulgence.",
      "price": 5.0,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Iced White Chocolate Mocha.jpg",
      "isFavorite": false
    },
    {
      "id": 21,
      "category": "Frappuccino Blends",
      "name": "Coffee Frappuccino",
      "description": "Blended coffee, milk, and ice topped with whipped cream.",
      "longDesc": "Our classic Coffee Frappuccino is a timeless favorite that blends rich coffee, milk, and ice to create a smooth, slushy texture. Topped with whipped cream, this refreshing beverage delivers the perfect balance of coffee flavor and icy coolness. It's the ultimate treat for hot days or whenever you're craving a delicious, drinkable dessert with a coffee kick.",
      "price": 4.8,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Coffee Frappuccino.jpg",
      "isFavorite": false
    },
    {
      "id": 22,
      "category": "Frappuccino Blends",
      "name": "Caramel Frappuccino",
      "description": "Blended coffee with caramel syrup, milk, and ice topped with whipped cream.",
      "longDesc": "Indulge in our Caramel Frappuccino, a sweet and creamy blended beverage that combines coffee, buttery caramel syrup, milk, and ice. Topped with whipped cream and a beautiful caramel drizzle, this drink offers layers of rich caramel flavor in every sip. It's like drinking a frozen caramel coffee dessert – perfectly sweet, wonderfully refreshing, and absolutely irresistible.",
      "price": 5.0,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Caramel Frappuccino.jpg",
      "isFavorite": true
    },
    {
      "id": 23,
      "category": "Frappuccino Blends",
      "name": "Mocha Frappuccino",
      "description": "Blended coffee, mocha sauce, milk, and ice with whipped cream topping.",
      "longDesc": "Chocolate and coffee lovers rejoice! Our Mocha Frappuccino blends rich coffee with bittersweet mocha sauce, milk, and ice for a perfectly balanced chocolate-coffee experience. Topped with whipped cream, this drink delivers the indulgent taste of a frozen mocha dessert. It's the perfect combination of chocolate decadence and coffee boldness in a refreshingly cold format.",
      "price": 5.2,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Mocha Frappuccino.jpg",
      "isFavorite": false
    },
    {
      "id": 24,
      "category": "Frappuccino Blends",
      "name": "Java Chip Frappuccino",
      "description": "Blended mocha sauce, coffee, milk, ice, and chocolate chips.",
      "longDesc": "Our Java Chip Frappuccino takes chocolate indulgence to the next level. This decadent beverage blends mocha sauce, coffee, milk, and ice with chocolate chips for added texture and chocolatey bursts. Topped with whipped cream and more chocolate chip pieces, it's a chocolate lover's dream come true. Every sip delivers a satisfying combination of smooth mocha flavor and crunchy chocolate bits.",
      "price": 5.4,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Java Chip Frappuccino.jpg",
      "isFavorite": true
    },
    {
      "id": 25,
      "category": "Frappuccino Blends",
      "name": "White Chocolate Mocha Frappuccino",
      "description": "White chocolate sauce, coffee, milk, and ice topped with whipped cream.",
      "longDesc": "Experience luxury in a cup with our White Chocolate Mocha Frappuccino. This elegant blended beverage combines coffee with sweet white chocolate sauce, milk, and ice for a smooth, creamy treat. Topped with whipped cream, it offers a more refined sweetness compared to traditional mocha. Perfect for those who appreciate sophisticated flavors in their frozen coffee drinks.",
      "price": 5.3,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/White Chocolate Mocha Frappuccino.jpg",
      "isFavorite": false
    },
    {
      "id": 26,
      "category": "Frappuccino Blends",
      "name": "Strawberries & Crème Frappuccino",
      "description": "Strawberry puree blended with milk and ice, topped with whipped cream.",
      "longDesc": "Enjoy a taste of summer with our Strawberries & Crème Frappuccino. This refreshing, coffee-free blended beverage combines sweet strawberry puree with milk and ice for a smooth, fruity treat. Topped with whipped cream, it's like drinking a strawberry milkshake with a sophisticated twist. Perfect for those who want a cool, sweet refreshment without the coffee.",
      "price": 5.0,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Strawberries & Crème Frappuccino.jpg",
      "isFavorite": true
    },
    {
      "id": 27,
      "category": "Frappuccino Blends",
      "name": "Matcha Green Tea Frappuccino",
      "description": "Blended milk, ice, and matcha for a refreshing green tea taste.",
      "longDesc": "Discover the vibrant flavors of Japan with our Matcha Green Tea Frappuccino. This refreshing blended beverage combines premium matcha green tea powder with milk and ice for a smooth, earthy-sweet taste. Topped with whipped cream, it offers a unique alternative to coffee-based drinks. Rich in antioxidants and featuring matcha's distinctive flavor, it's both delicious and energizing.",
      "price": 5.2,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Matcha Green Tea Frappuccino.jpg",
      "isFavorite": false
    },
    {
      "id": 28,
      "category": "Frappuccino Blends",
      "name": "Vanilla Bean Crème Frappuccino",
      "description": "Vanilla bean, milk, and ice topped with whipped cream.",
      "longDesc": "Indulge in the pure, simple sweetness of our Vanilla Bean Crème Frappuccino. This coffee-free blended beverage combines real vanilla bean, milk, and ice for a smooth, creamy treat that tastes like a frozen vanilla custard. Topped with whipped cream, it's perfect for those who want the Frappuccino experience without coffee. The visible vanilla bean specks add an elegant touch to this classic favorite.",
      "price": 5.1,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Vanilla Bean Crème Frappuccino.jpg",
      "isFavorite": false
    },
    {
      "id": 29,
      "category": "Frappuccino Blends",
      "name": "Double Chocolate Chip Frappuccino",
      "description": "Rich mocha flavor with chocolate chips blended with milk and ice.",
      "longDesc": "For the ultimate chocolate experience, try our Double Chocolate Chip Frappuccino. This decadent, coffee-free blended beverage combines rich chocolate sauce with chocolate chips, milk, and ice for an intensely chocolatey treat. Topped with whipped cream and more chocolate chips, it's like drinking a frozen chocolate shake elevated to gourmet status. Perfect for chocolate purists who want maximum chocolate flavor.",
      "price": 5.3,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Double Chocolate Chip Frappuccino.jpg",
      "isFavorite": true
    },
    {
      "id": 30,
      "category": "Frappuccino Blends",
      "name": "Cookies & Cream Frappuccino",
      "description": "Blended coffee, milk, ice, and cookie crumbles topped with whipped cream.",
      "longDesc": "Satisfy your cookie cravings with our Cookies & Cream Frappuccino. This indulgent blended beverage combines coffee, milk, and ice with crushed chocolate sandwich cookies for a cookies-and-cream flavor explosion. Topped with whipped cream and more cookie pieces, it's like drinking your favorite ice cream flavor in coffee form. Each sip delivers the perfect balance of coffee and cookie goodness.",
      "price": 5.4,
      "sizes": ["Tall", "Grande", "Venti"],
      "image": "/pic/Cookies & Cream Frappuccino.jpg",
      "isFavorite": false
    },
    {
      "id": 31,
      "category": "Pastries",
      "name": "Blueberry Muffin",
      "description": "Soft muffin filled with juicy blueberries and sugar crumble.",
      "longDesc": "Start your morning right with our classic Blueberry Muffin. Baked fresh daily, this moist, tender muffin is loaded with plump, juicy blueberries and topped with a sweet sugar crumble that adds the perfect crunch. Made with premium ingredients and bursting with berry flavor, it's the perfect companion to your morning coffee or afternoon tea break.",
      "price": 2.8,
      "sizes": [],
      "image": "/pic/Blueberry Muffin.jpg",
      "isFavorite": false
    },
    {
      "id": 32,
      "category": "Pastries",
      "name": "Chocolate Croissant",
      "description": "Flaky pastry filled with rich chocolate, baked golden brown.",
      "longDesc": "Indulge in the French classic with our Chocolate Croissant (Pain au Chocolat). This buttery, flaky pastry features layers of golden, crispy croissant dough wrapped around rich, melting chocolate bars. Baked to perfection, each bite delivers a satisfying contrast between the crispy exterior and the smooth chocolate interior. It's a timeless European treat that pairs beautifully with any coffee.",
      "price": 3.0,
      "sizes": [],
      "image": "/pic/Chocolate Croissant.jpg",
      "isFavorite": true
    },
    {
      "id": 33,
      "category": "Pastries",
      "name": "Butter Croissant",
      "description": "Classic, buttery, flaky croissant perfect with coffee.",
      "longDesc": "Experience the art of French baking with our classic Butter Croissant. Crafted with premium European butter and traditional techniques, this golden pastry features countless delicate, flaky layers that shatter with each bite. Light, airy, and rich with buttery flavor, it's the perfect breakfast pastry or anytime treat. Enjoy it plain or with your favorite jam or spread.",
      "price": 2.5,
      "sizes": [],
      "image": "/pic/Butter Croissant.jpg",
      "isFavorite": false
    },
    {
      "id": 34,
      "category": "Pastries",
      "name": "Cinnamon Roll",
      "description": "Sweet roll filled with cinnamon and topped with icing.",
      "longDesc": "Treat yourself to our decadent Cinnamon Roll. This oversized sweet roll features soft, pillowy dough swirled with a generous amount of cinnamon-sugar filling and topped with a thick layer of cream cheese icing. Baked fresh throughout the day, it's warm, gooey, and absolutely irresistible. Perfect for breakfast, dessert, or any time you need a sweet indulgence.",
      "price": 3.2,
      "sizes": [],
      "image": "/pic/Cinnamon Roll.jpg",
      "isFavorite": false
    },
    {
      "id": 35,
      "category": "Pastries",
      "name": "Banana Bread",
      "description": "Moist banana bread with a hint of walnut and cinnamon.",
      "longDesc": "Enjoy the comforting flavors of home with our Banana Bread. Made with ripe bananas, crunchy walnuts, and a touch of cinnamon, this moist, dense loaf offers the perfect balance of sweetness and spice. Baked fresh daily, it's excellent on its own or warmed up with a pat of butter. This wholesome treat makes an ideal breakfast or afternoon snack alongside your favorite beverage.",
      "price": 3.0,
      "sizes": [],
      "image": "/pic/Banana Bread.jpg",
      "isFavorite": true
    },
    {
      "id": 36,
      "category": "Pastries",
      "name": "Chocolate Chip Cookie",
      "description": "Soft and chewy cookie loaded with chocolate chips.",
      "longDesc": "Satisfy your sweet tooth with our classic Chocolate Chip Cookie. This oversized cookie is baked to perfection – crispy on the edges, soft and chewy in the center, and loaded with premium chocolate chips throughout. Made with real butter and high-quality ingredients, it's the ultimate cookie experience. Enjoy it with a glass of cold milk or your favorite coffee drink.",
      "price": 2.0,
      "sizes": [],
      "image": "/pic/Chocolate Chip Cookie.jpg",
      "isFavorite": false
    },
    {
      "id": 37,
      "category": "Pastries",
      "name": "Pumpkin Loaf",
      "description": "Spiced pumpkin bread with warm cinnamon flavor.",
      "longDesc": "Embrace the flavors of fall with our Pumpkin Loaf. This moist, flavorful bread is made with real pumpkin and a perfect blend of warm spices including cinnamon, nutmeg, and cloves. The result is a comforting, aromatic loaf that captures the essence of autumn in every slice. Enjoy it year-round as a delicious breakfast option or afternoon treat with your coffee or tea.",
      "price": 3.4,
      "sizes": [],
      "image": "/pic/Pumpkin Loaf.jpg",
      "isFavorite": true
    },
    {
      "id": 38,
      "category": "Pastries",
      "name": "Almond Croissant",
      "description": "Flaky croissant filled with almond cream and topped with toasted almonds.",
      "longDesc": "Elevate your croissant experience with our luxurious Almond Croissant. This French pastry masterpiece features a buttery, flaky croissant filled with rich almond cream (frangipane), topped with sliced almonds and dusted with powdered sugar. Baked until golden and fragrant, it offers an indulgent combination of textures and flavors. It's a sophisticated treat that transforms any coffee break into a special occasion.",
      "price": 3.5,
      "sizes": [],
      "image": "/pic/Almond Croissant.jpg",
      "isFavorite": false
    },
    {
      "id": 39,
      "category": "Pastries",
      "name": "Lemon Loaf",
      "description": "Moist lemon cake with a sweet lemon glaze.",
      "longDesc": "Brighten your day with our refreshing Lemon Loaf. This moist, tender cake is infused with fresh lemon zest and juice, creating a perfect balance of sweet and tart flavors. Topped with a sweet lemon glaze that adds extra moisture and citrus punch, it's the ideal pick-me-up for any time of day. The bright, sunny flavor pairs wonderfully with tea or coffee.",
      "price": 3.2,
      "sizes": [],
      "image": "/pic/Lemon Loaf.jpg",
      "isFavorite": false
    },
    {
      "id": 40,
      "category": "Pastries",
      "name": "Oatmeal Cookie",
      "description": "Chewy oatmeal cookie with raisins and cinnamon spice.",
      "longDesc": "Enjoy a wholesome treat with our Oatmeal Cookie. Made with hearty oats, plump raisins, and a touch of cinnamon, this chewy cookie offers a more nutritious alternative to traditional cookies without sacrificing flavor. The combination of oats and raisins provides natural sweetness and satisfying texture, while the cinnamon adds warmth. It's perfect for a guilt-free indulgence with your morning coffee or afternoon tea.",
      "price": 2.3,
      "sizes": [],
      "image": "/pic/Oatmeal Cookie.jpg",
      "isFavorite": true
    }
  ]
}
